Start with the name of Allah who is the most Benefical and most Mercifull

# 5.2 Essential Functionality

In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(["a","b","c","d","e"])

In [5]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [7]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [8]:
obj3.reindex(range(6),method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [9]:
frame = pd.DataFrame(np.arange(9).reshape( (3,3) ) ,index=["a","b","c"],columns=["California","Ohio","Texas"] )

In [10]:
frame

   California  Ohio  Texas
a           0     1      2
b           3     4      5
c           6     7      8

In [11]:
frame2 = frame.reindex(["a","b","c","d"])

In [12]:
frame2

   California  Ohio  Texas
a         0.0   1.0    2.0
b         3.0   4.0    5.0
c         6.0   7.0    8.0
d         NaN   NaN    NaN

In [13]:
states = ["Texas","Utah","California"]

In [14]:
frame.reindex(columns=states)

   Texas  Utah  California
a      2   NaN           0
b      5   NaN           3
c      8   NaN           6

In [15]:
#frame.loc[ ["a","b","c","d"] ,states ]

# Dropping Entries from an Axis

In [16]:
obj = pd.Series( np.arange(5.),index=["a","b","c","d","e"])

In [17]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [18]:
new_obj = obj.drop("c")

In [19]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [20]:
obj.drop(["d","e"])

a    0.0
b    1.0
c    2.0
dtype: float64

In [21]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [22]:
data.drop(["Colorado","Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data.drop("two",axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [24]:
data.drop( ["two","four"],axis="columns" )

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [25]:
obj.drop("c",inplace=True)

In [26]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64